RU: dict[str, str] = {
    "/start": "Привет! 🎵 Добро пожаловать в музыкального бота с интеграцией Spotify. Я помогу найти треки, плейлисты и рекомендации. Авторизуйся в Spotify и Let's go слушать песни нашей эпохи! 🚀\n\nНажми /help для списка команд. 🎧",
    "/help": "Вот что я умею:\n\n" 
                "🎶1. Кнопка: Топ-50 сегодня — Поиск 50 лучших трэков на сегодняшний день\n"
                "2. 🏆Кнопка: Топ-50 за все время — Поиск 50 лучших трэков за все время\n"
                "3.🔍 Поиск трека\n"
                "4.🔍 Поиск альбома\n"
                "5.🔍 Поиск артиста\n"
                "6./lang — сменить язык интерфейса\n"
                "7./help — посмотреть эту справку\n",
    "/help_admin": "Вот что я умею:\n "
                   "🎶<b>Кнопка: Топ-50 сегодня</b> — Поиск 50 лучших трэков на сегодняшний день\n"
                   "🏆<b>Кнопка: Топ-50 за все время</b> — Поиск 50 лучших трэков за все время\n"
                   "🔍<b>Поиск трека</b>\n"
                   "🔍<b>Поиск альбома</b>\n"
                   "🔍<b>Поиск артиста</b>\n"
                   "/start — перезапуск бота\n"
                   "/lang — установить язык интерфейса\n"
                   "/help — посмотреть эту справку\n"
                   "/ban — забанить пользователя\n"
                   "/unban — разбанить пользователя\n",
    "auth_spotify": "Авторизуйся в Spotify для полного доступа: [вставь_ссылку_на_авторизацию]. 🔑 Это безопасно и быстро!",


    "auth_button": "Авторизация",
    "/lang": "Выберите язык",
    "no_echo": "Данный тип апдейтов не поддерживается методом send_copy",
    "ru": "🇷🇺 Русский",
    "en": "🇬🇧 Английский",
    "save_lang_button_text": "✅ Сохранить",
    "cancel_lang_button_text": "Отмена",
    "lang_saved": "Язык успешно установлен и далее будет использоваться для отображения "
                  "интерфейса бота!\n\nЕсли хотите - можете мне что-нибудь прислать или "
                  "отправить команду /help",
    "lang_cancelled": "Хорошо, ваш язык по-прежнему: {}.\n\nЕсли хотите - можете мне что-нибудь "
                      "прислать или отправить команду /help",
    "/start_description": "Перезапустить бота",
    "/lang_description": "Настроить язык интерфейса",
    "/help_description": "Посмотреть справку по работе бота",
    "/ban_description": "Забанить пользователя (требует user_id или username)",
    "/unban_description": "Разбанить пользователя (требует user_id или username)",
    "/statistics_description": "Посмотреть статистику активности пользователей",
    "empty_ban_answer": "❗ Пожалуйста, укажите ID пользователя или @username.",
    "incorrect_ban_arg": "⚠️ <b>Неверный формат.</b>\n\nИспользуйте: /ban <code>ID</code> "
                         "или /ban <code>@username</code>",
    "already_banned": "❗ Пользователь и так уже забанен!",
    "successfully_banned": "⚠️ Пользователь успешно забанен!",
    "no_user": "❗ Нет такого пользователя в базе данных!",
    "empty_unban_answer": "❗ Пожалуйста, укажите ID пользователя или @username.",
    "incorrect_unban_arg": "⚠️ <b>Неверный формат.</b>\n\nИспользуйте: /unban <code>ID</code> "
                           "или /unban <code>@username</code>",
    "not_banned": "❗ Пользователь и так не был забанен!",
    "successfully_unbanned": "⚠️ Пользователь успешно разбанен!",
    "statistics": "📊 <b>Статистика по действиям пользователей:</b>\n\n{}",



    "main_menu":"🎧 <b>Музыкальный бот!</b>\nВыбери раздел:",
    "top_today_button":"📈 Топ-50 сегодня",
    "top_alltime_button":"🏆 Топ-50 за все время",
    "search_track":"🔍 Поиск трека",
    "search_album":"🔍 Поиск альбома",
    "search_artist":"🔍 Поиск артиста",
    "search_album_dio":"🔍 Поиск альбома исполнителя:",
    "back": "◀️ Назад",
    "album_word": "Альбом",
    "list_artists":"🔍 Список артистов:",
    "list_album_single":"🔍 Список альбомов и синглов артиста:",
    "artist_word": "артиста",
    "search_track_artist":"🔍 Поиск трека или исполнителя:",
    "top_allitime_dio":"🏆 Топ-50 за все время! Выбери трек:",
    "top_today_dio":"📈 Топ-50 сегодня! Выбери трек:",

}
